Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: ومثل كلمة خبيثة كشجرة خبيثة اجتثت من فوق الأرض ما لها من قرار
en: And the parable of an evil Word is that of an evil tree: It is torn up by the root from the surface of the earth: it has no stability.

source: يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة ويضل الله الظالمين ويفعل الله ما يشاء
en: Allah will establish in strength those who believe, with the word that stands firm, in this world and in the Hereafter; but Allah will leave, to stray, those who do wrong: Allah doeth what He willeth.

source: ألم تر إلى الذين بدلوا نعمت الله كفرا وأحلوا قومهم دار البوار
en: Hast thou not turned thy vision to those who have changed the favour of Allah. Into blasphemy and caused their people to descend to the House of Perdition?-

source: جهنم يصلونها وبئس القرار
en: Into Hell? They will burn therein,- an evil place to stay in!

source: وجعلوا لله أندادا ليضلوا عن سبيله قل تمتعوا فإن مصيركم إلى النار
en: And they set up (idols) as equal to Allah, to mislead (men) from the Path! Say: "Enjoy (your brief power)! But verily ye are making straightway for Hell!"

source: قل لعبادي الذين آمنوا يقيموا الصلاة وينفقوا مما رزقناهم سرا وعلانية من قبل أن يأتي يوم لا بيع فيه ولا خلال
en: Speak to my servants who have believed, that they may establish regular prayers, and spend (in charity) out of the sustenance we have given them, secretly and openly, before the coming of a Day in which there will be neither mutual bargaining nor befriending.

source: الله الذي خلق السماوات والأرض وأنزل من السماء ماء فأخرج به من الثمرات رزقا لكم وسخر لكم الفلك لتجري في البحر بأمره وسخر لكم الأنهار
en: It is Allah Who hath created the heavens and the earth and sendeth down rain from the skies, and with it bringeth out fruits wherewith to feed you; it is He Who hath made the ships subject to you, that they may sail through the sea by His command; and the rivers (also) hath He made subject to you.

source: وسخر لكم الشمس والقمر دائبين وسخر لكم الليل والنهار
en: And He hath made subject to you the sun and the moon, both diligently pursuing their courses; and the night and the day hath he (also) made subject to you.

source: وآتاكم من كل ما سألتموه وإن تعدوا نعمت الله لا تحصوها إن الإنسان لظلوم كفار
en: And He giveth you of all that ye ask for. But if ye count the favours of Allah, never will ye be able to number them. Verily, man is given up to injustice and ingratitude.

source: وإذ قال إبراهيم رب اجعل هذا البلد آمنا واجنبني وبني أن نعبد الأصنام
en: Remember Abraham said: "O my Lord! make this city one of peace and security: and preserve me and my sons from worshipping idols.

source: رب إنهن أضللن كثيرا من الناس فمن تبعني فإنه مني ومن عصاني فإنك غفور رحيم
en: "O my Lord! they have indeed led astray many among mankind; He then who follows my (ways) is of me, and he that disobeys me,- but Thou art indeed Oft-forgiving, Most Merciful.

source: ربنا إني أسكنت من ذريتي بواد غير ذي زرع عند بيتك المحرم ربنا ليقيموا الصلاة فاجعل أفئدة من الناس تهوي إليهم وارزقهم من الثمرات لعلهم يشكرون
en: "O our Lord! I have made some of my offspring to dwell in a valley without cultivation, by Thy Sacred House; in order, O our Lord, that they may establish regular Prayer: so fill the hearts of some among men with love towards them, and feed them with fruits: so that they may give thanks.

source: ربنا إنك تعلم ما نخفي وما نعلن وما يخفى على الله من شيء في الأرض ولا في السماء
en: "O our Lord! truly Thou dost know what we conceal and what we reveal: for nothing whatever is hidden from Allah, whether on earth or in heaven.

source: الحمد لله الذي وهب لي على الكبر إسماعيل وإسحاق إن ربي لسميع الدعاء
en: "Praise be to Allah, Who hath granted unto me in old age Isma'il and Isaac: for truly my Lord is He, the Hearer of Prayer!

source: رب اجعلني مقيم الصلاة ومن ذريتي ربنا وتقبل دعاء
en: O my Lord! make me one who establishes regular Prayer, and also (raise such) among my offspring O our Lord! and accept Thou my Prayer.

source: ربنا اغفر لي ولوالدي وللمؤمنين يوم يقوم الحساب
en: "O our Lord! cover (us) with Thy Forgiveness - me, my parents, and (all) Believers, on the Day that the Reckoning will be established!

source: ولا تحسبن الله غافلا عما يعمل الظالمون إنما يؤخرهم ليوم تشخص فيه الأبصار
en: Think not that Allah doth not heed the deeds of those who do wrong. He but giveth them respite against a Day when the eyes will fixedly stare in horror,-

source: مهطعين مقنعي رءوسهم لا يرتد إليهم طرفهم وأفئدتهم هواء
en: They running forward with necks outstretched, their heads uplifted, their gaze returning not towards them, and their hearts a (gaping) void!

source: وأنذر الناس يوم يأتيهم العذاب فيقول الذين ظلموا ربنا أخرنا إلى أجل قريب نجب دعوتك ونتبع الرسل أولم تكونوا أقسمتم من قبل ما لكم من زوال
en: So warn mankind of the Day when the Wrath will reach them: then will the wrong-doers say: "Our Lord! respite us (if only) for a short term: we will answer Thy call, and follow the messengers!" "What! were ye not wont to swear aforetime that ye should suffer no decline?

source: وسكنتم في مساكن الذين ظلموا أنفسهم وتبين لكم كيف فعلنا بهم وضربنا لكم الأمثال
en: "And ye dwelt in the dwellings of men who wronged their own souls; ye were clearly shown how We dealt with them; and We put forth (many) parables in your behoof!"

source: وقد مكروا مكرهم وعند الله مكرهم وإن كان مكرهم لتزول منه الجبال
en: Mighty indeed were the plots which they made, but their plots were (well) within the sight of Allah, even though they were such as to shake the hills!

source: فلا تحسبن الله مخلف وعده رسله إن الله عزيز ذو انتقام
en: Never think that Allah would fail his messengers in His promise: for Allah is Exalted in power, - the Lord of Retribution.

source: يوم تبدل الأرض غير الأرض والسماوات وبرزوا لله الواحد القهار
en: One day the earth will be changed to a different earth, and so will be the heavens, and (men) will be marshalled forth, before Allah, the One, the Irresistible;

source: وترى المجرمين يومئذ مقرنين في الأصفاد
en: And thou wilt see the sinners that day bound together in fetters;-

source: سرابيلهم من قطران وتغشى وجوههم النار
en: Their garments of liquid pitch, and their faces covered with Fire;

source: ليجزي الله كل نفس ما كسبت إن الله سريع الحساب
en: That Allah may requite each soul according to its deserts; and verily Allah is swift in calling to account.

source: هذا بلاغ للناس ولينذروا به وليعلموا أنما هو إله واحد وليذكر أولو الألباب
en: Here is a Message for mankind: Let them take warning therefrom, and let them know that He is (no other than) One Allah: let men of understanding take heed.

source: الر تلك آيات الكتاب وقرآن مبين
en: A. L. R. These are the Ayats of Revelation,- of a Qur'an that makes things clear.

source: ربما يود الذين كفروا لو كانوا مسلمين
en: Again and again will those who disbelieve, wish that they had bowed (to Allah's will) in Islam.

source: ذرهم يأكلوا ويتمتعوا ويلههم الأمل فسوف يعلمون
en: Leave them alone, to enjoy (the good things of this life) and to please themselves: let (false) hope amuse them: soon will knowledge (undeceive them).

source: وما أهلكنا من قرية إلا ولها كتاب معلوم
en: Never did We destroy a population that had not a term decreed and assigned beforehand.

source: ما تسبق من أمة أجلها وما يستأخرون
en: Neither can a people anticipate its term, nor delay it.

source: وقالوا يا أيها الذي نزل عليه الذكر إنك لمجنون
en: They say: "O thou to whom the Message is being revealed! truly thou art mad (or possessed)!

source: لو ما تأتينا بالملائكة إن كنت من الصادقين
en: "Why bringest thou not angels to us if it be that thou hast the Truth?"

source: ما ننزل الملائكة إلا بالحق وما كانوا إذا منظرين
en: We send not the angels down except for just cause: if they came (to the ungodly), behold! no respite would they have!

source: إنا نحن نزلنا الذكر وإنا له لحافظون
en: We have, without doubt, sent down the Message; and We will assuredly guard it (from corruption).

source: ولقد أرسلنا من قبلك في شيع الأولين
en: We did send messengers before thee amongst the religious sects of old:

source: وما يأتيهم من رسول إلا كانوا به يستهزئون
en: But never came a messenger to them but they mocked him.

source: كذلك نسلكه في قلوب المجرمين
en: Even so do we let it creep into the hearts of the sinners -

source: لا يؤمنون به وقد خلت سنة الأولين
en: That they should not believe in the (Message); but the ways of the ancients have passed away.

source: ولو فتحنا عليهم بابا من السماء فظلوا فيه يعرجون
en: Even if We opened out to them a gate from heaven, and they were to continue (all day) ascending therein,

source: لقالوا إنما سكرت أبصارنا بل نحن قوم مسحورون
en: They would only say: "Our eyes have been intoxicated: Nay, we have been bewitched by sorcery."

source: ولقد جعلنا في السماء بروجا وزيناها للناظرين
en: It is We Who have set out the zodiacal signs in the heavens, and made them fair-seeming to (all) beholders;

source: وحفظناها من كل شيطان رجيم
en: And (moreover) We have guarded them from every cursed devil:

source: إلا من استرق السمع فأتبعه شهاب مبين
en: But any that gains a hearing by stealth, is pursued by a flaming fire, bright (to see).

source: والأرض مددناها وألقينا فيها رواسي وأنبتنا فيها من كل شيء موزون
en: And the earth We have spread out (like a carpet); set thereon mountains firm and immovable; and produced therein all kinds of things in due balance.

source: وجعلنا لكم فيها معايش ومن لستم له برازقين
en: And We have provided therein means of subsistence,- for you and for those for whose sustenance ye are not responsible.

source: وإن من شيء إلا عندنا خزائنه وما ننزله إلا بقدر معلوم
en: And there is not a thing but its (sources and) treasures (inexhaustible) are with Us; but We only send down thereof in due and ascertainable measures.

source: وأرسلنا الرياح لواقح فأنزلنا من السماء ماء فأسقيناكموه وما أنتم له بخازنين
en: And We send the fecundating winds, then cause the rain to descend from the sky, therewith providing you with water (in abundance), though ye are not the guardians of its stores.

source: وإنا لنحن نحيي ونميت ونحن الوارثون
en: And verily, it is We Who give life, and Who give death: it is We Who remain inheritors (after all else passes away).

source: ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين
en: To Us are known those of you who hasten forward, and those who lag behind.

source: وإن ربك هو يحشرهم إنه حكيم عليم
en: Assuredly it is thy Lord Who will gather them together: for He is perfect in Wisdom and Knowledge.

source: ولقد خلقنا الإنسان من صلصال من حمإ مسنون
en: We created man from sounding clay, from mud moulded into shape;

source: والجان خلقناه من قبل من نار السموم
en: And the Jinn race, We had created before, from the fire of a scorching wind.

source: وإذ قال ربك للملائكة إني خالق بشرا من صلصال من حمإ مسنون
en: Behold! thy Lord said to the angels: "I am about to create man, from sounding clay from mud moulded into shape;

source: فإذا سويته ونفخت فيه من روحي فقعوا له ساجدين
en: "When I have fashioned him (in due proportion) and breathed into him of My spirit, fall ye down in obeisance unto him."

source: فسجد الملائكة كلهم أجمعون
en: So the angels prostrated themselves, all of them together:

source: إلا إبليس أبى أن يكون مع الساجدين
en: Not so Iblis: he refused to be among those who prostrated themselves.

source: قال يا إبليس ما لك ألا تكون مع الساجدين
en: (Allah) said: "O Iblis! what is your reason for not being among those who prostrated themselves?"

source: قال لم أكن لأسجد لبشر خلقته من صلصال من حمإ مسنون
en: (Iblis) said: "I am not one to prostrate myself to man, whom Thou didst create from sounding clay, from mud moulded into shape."

source: قال فاخرج منها فإنك رجيم
en: (Allah) said: "Then get thee out from here; for thou art rejected, accursed.

source: وإن عليك اللعنة إلى يوم الدين
en: "And the curse shall be on thee till the day of Judgment."

source: قال رب فأنظرني إلى يوم يبعثون
en: (Iblis) said: "O my Lord! give me then respite till the Day the (dead) are raised."

source: قال فإنك من المنظرين
en: (Allah) said: "Respite is granted thee

source: إلى يوم الوقت المعلوم
en: "Till the Day of the Time appointed."

source: قال رب بما أغويتني لأزينن لهم في الأرض ولأغوينهم أجمعين
en: (Iblis) said: "O my Lord! because Thou hast put me in the wrong, I will make (wrong) fair-seeming to them on the earth, and I will put them all in the wrong,-

source: إلا عبادك منهم المخلصين
en: "Except Thy servants among them, sincere and purified (by Thy Grace)."

source: قال هذا صراط علي مستقيم
en: (Allah) said: "This (way of My sincere servants) is indeed a way that leads straight to Me.

source: إن عبادي ليس لك عليهم سلطان إلا من اتبعك من الغاوين
en: "For over My servants no authority shalt thou have, except such as put themselves in the wrong and follow thee."

source: وإن جهنم لموعدهم أجمعين
en: And verily, Hell is the promised abode for them all!

source: لها سبعة أبواب لكل باب منهم جزء مقسوم
en: To it are seven gates: for each of those gates is a (special) class (of sinners) assigned.

source: إن المتقين في جنات وعيون
en: The righteous (will be) amid gardens and fountains (of clear-flowing water).

source: ادخلوها بسلام آمنين
en: (Their greeting will be): "Enter ye here in peace and security."

source: ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين
en: And We shall remove from their hearts any lurking sense of injury: (they will be) brothers (joyfully) facing each other on thrones (of dignity).

source: لا يمسهم فيها نصب وما هم منها بمخرجين
en: There no sense of fatigue shall touch them, nor shall they (ever) be asked to leave.

source: نبئ عبادي أني أنا الغفور الرحيم
en: Tell My servants that I am indeed the Oft-forgiving, Most Merciful;

source: وأن عذابي هو العذاب الأليم
en: And that My Penalty will be indeed the most grievous Penalty.

source: ونبئهم عن ضيف إبراهيم
en: Tell them about the guests of Abraham.

source: إذ دخلوا عليه فقالوا سلاما قال إنا منكم وجلون
en: When they entered his presence and said, "Peace!" He said, "We feel afraid of you!"

source: قالوا لا توجل إنا نبشرك بغلام عليم
en: They said: "Fear not! We give thee glad tidings of a son endowed with wisdom."

source: قال أبشرتموني على أن مسني الكبر فبم تبشرون
en: He said: "Do ye give me glad tidings that old age has seized me? Of what, then, is your good news?"

source: قالوا بشرناك بالحق فلا تكن من القانطين
en: They said: "We give thee glad tidings in truth: be not then in despair!"

source: قال ومن يقنط من رحمة ربه إلا الضالون
en: He said: "And who despairs of the mercy of his Lord, but such as go astray?"

source: قال فما خطبكم أيها المرسلون
en: Abraham said: "What then is the business on which ye (have come), O ye messengers (of Allah)?"

source: قالوا إنا أرسلنا إلى قوم مجرمين
en: They said: "We have been sent to a people (deep) in sin,

source: إلا آل لوط إنا لمنجوهم أجمعين
en: "Excepting the adherents of Lut: them we are certainly (charged) to save (from harm),- All -

source: إلا امرأته قدرنا إنها لمن الغابرين
en: "Except his wife, who, We have ascertained, will be among those who will lag behind."

source: فلما جاء آل لوط المرسلون
en: At length when the messengers arrived among the adherents of Lut,

source: قال إنكم قوم منكرون
en: He said: "Ye appear to be uncommon folk."

source: قالوا بل جئناك بما كانوا فيه يمترون
en: They said: "Yea, we have come to thee to accomplish that of which they doubt.

source: وأتيناك بالحق وإنا لصادقون
en: "We have brought to thee that which is inevitably due, and assuredly we tell the truth.

source: فأسر بأهلك بقطع من الليل واتبع أدبارهم ولا يلتفت منكم أحد وامضوا حيث تؤمرون
en: "Then travel by night with thy household, when a portion of the night (yet remains), and do thou bring up the rear: let no one amongst you look back, but pass on whither ye are ordered."

source: وقضينا إليه ذلك الأمر أن دابر هؤلاء مقطوع مصبحين
en: And We made known this decree to him, that the last remnants of those (sinners) should be cut off by the morning.

source: وجاء أهل المدينة يستبشرون
en: The inhabitants of the city came in (mad) joy (at news of the young men).

source: قال إن هؤلاء ضيفي فلا تفضحون
en: Lut said: "These are my guests: disgrace me not:

source: واتقوا الله ولا تخزون
en: "But fear Allah, and shame me not."

source: قالوا أولم ننهك عن العالمين
en: They said: "Did we not forbid thee (to speak) for all and sundry?"

source: قال هؤلاء بناتي إن كنتم فاعلين
en: He said: "There are my daughters (to marry), if ye must act (so)."

source: لعمرك إنهم لفي سكرتهم يعمهون
en: Verily, by thy life (O Prophet), in their wild intoxication, they wander in distraction, to and fro.

source: فأخذتهم الصيحة مشرقين
en: But the (mighty) Blast overtook them before morning,

source: فجعلنا عاليها سافلها وأمطرنا عليهم حجارة من سجيل
en: And We turned (the cities) upside down, and rained down on them brimstones hard as baked clay.

source: إن في ذلك لآيات للمتوسمين
en: Behold! in this are Signs for those who by tokens do understand.

source: وإنها لبسبيل مقيم
en: And the (cities were) right on the high-road.

source: إن في ذلك لآية للمؤمنين
en: Behold! in this is a sign for those who believed.

source: وإن كان أصحاب الأيكة لظالمين
en: And the Companions of the Wood were also wrong-doers;

source: فانتقمنا منهم وإنهما لبإمام مبين
en: So We exacted retribution from them. They were both on an open highway, plain to see.

source: ولقد كذب أصحاب الحجر المرسلين
en: The Companions of the Rocky Tract also rejected the messengers:

source: وآتيناهم آياتنا فكانوا عنها معرضين
en: We sent them Our Signs, but they persisted in turning away from them.

source: وكانوا ينحتون من الجبال بيوتا آمنين
en: Out of the mountains did they hew (their) edifices, (feeling themselves) secure.

source: فأخذتهم الصيحة مصبحين
en: But the (mighty) Blast seized them of a morning,

source: فما أغنى عنهم ما كانوا يكسبون
en: And of no avail to them was all that they did (with such art and care)!

source: وما خلقنا السماوات والأرض وما بينهما إلا بالحق وإن الساعة لآتية فاصفح الصفح الجميل
en: We created not the heavens, the earth, and all between them, but for just ends. And the Hour is surely coming (when this will be manifest). So overlook (any human faults) with gracious forgiveness.

source: إن ربك هو الخلاق العليم
en: For verily it is thy Lord who is the Master-Creator, knowing all things.

source: ولقد آتيناك سبعا من المثاني والقرآن العظيم
en: And We have bestowed upon thee the Seven Oft-repeated (verses) and the Grand Qur'an.

source: لا تمدن عينيك إلى ما متعنا به أزواجا منهم ولا تحزن عليهم واخفض جناحك للمؤمنين
en: Strain not thine eyes. (Wistfully) at what We have bestowed on certain classes of them, nor grieve over them: but lower thy wing (in gentleness) to the believers.

source: وقل إني أنا النذير المبين
en: And say: "I am indeed he that warneth openly and without ambiguity,"-

source: كما أنزلنا على المقتسمين
en: (Of just such wrath) as We sent down on those who divided (Scripture into arbitrary parts),-

source: الذين جعلوا القرآن عضين
en: (So also on such) as have made Qur'an into shreds (as they please).

source: فوربك لنسألنهم أجمعين
en: Therefore, by the Lord, We will, of a surety, call them to account,

source: عما كانوا يعملون
en: For all their deeds.

source: فاصدع بما تؤمر وأعرض عن المشركين
en: Therefore expound openly what thou art commanded, and turn away from those who join false gods with Allah.

source: إنا كفيناك المستهزئين
en: For sufficient are We unto thee against those who scoff,-

source: الذين يجعلون مع الله إلها آخر فسوف يعلمون
en: Those who adopt, with Allah, another god: but soon will they come to know.

source: ولقد نعلم أنك يضيق صدرك بما يقولون
en: We do indeed know how thy heart is distressed at what they say.

source: فسبح بحمد ربك وكن من الساجدين
en: But celebrate the praises of thy Lord, and be of those who prostrate themselves in adoration.

source: واعبد ربك حتى يأتيك اليقين
en: And serve thy Lord until there come unto thee the Hour that is Certain.

source: أتى أمر الله فلا تستعجلوه سبحانه وتعالى عما يشركون
en: (Inevitable) cometh (to pass) the Command of Allah: seek ye not then to hasten it: Glory to Him, and far is He above having the partners they ascribe unto Him!

source: ينزل الملائكة بالروح من أمره على من يشاء من عباده أن أنذروا أنه لا إله إلا أنا فاتقون
en: He doth send down His angels with inspiration of His Command, to such of His servants as He pleaseth, (saying): "Warn (Man) that there is no god but I: so do your duty unto Me."

source: خلق السماوات والأرض بالحق تعالى عما يشركون
en: He has created the heavens and the earth for just ends: Far is He above having the partners they ascribe to Him!

source: خلق الإنسان من نطفة فإذا هو خصيم مبين
en: He has created man from a sperm-drop; and behold this same (man) becomes an open disputer!

source: والأنعام خلقها لكم فيها دفء ومنافع ومنها تأكلون
en: And cattle He has created for you (men): from them ye derive warmth, and numerous benefits, and of their (meat) ye eat.

source: ولكم فيها جمال حين تريحون وحين تسرحون
en: And ye have a sense of pride and beauty in them as ye drive them home in the evening, and as ye lead them forth to pasture in the morning.

source: وتحمل أثقالكم إلى بلد لم تكونوا بالغيه إلا بشق الأنفس إن ربكم لرءوف رحيم
en: And they carry your heavy loads to lands that ye could not (otherwise) reach except with souls distressed: for your Lord is indeed Most Kind, Most Merciful,

source: والخيل والبغال والحمير لتركبوها وزينة ويخلق ما لا تعلمون
en: And (He has created) horses, mules, and donkeys, for you to ride and use for show; and He has created (other) things of which ye have no knowledge.

source: وعلى الله قصد السبيل ومنها جائر ولو شاء لهداكم أجمعين
en: And unto Allah leads straight the Way, but there are ways that turn aside: if Allah had willed, He could have guided all of you.

source: هو الذي أنزل من السماء ماء لكم منه شراب ومنه شجر فيه تسيمون
en: It is He who sends down rain from the sky: from it ye drink, and out of it (grows) the vegetation on which ye feed your cattle.

source: ينبت لكم به الزرع والزيتون والنخيل والأعناب ومن كل الثمرات إن في ذلك لآية لقوم يتفكرون
en: With it He produces for you corn, olives, date-palms, grapes and every kind of fruit: verily in this is a sign for those who give thought.

source: وسخر لكم الليل والنهار والشمس والقمر والنجوم مسخرات بأمره إن في ذلك لآيات لقوم يعقلون
en: He has made subject to you the Night and the Day; the sun and the moon; and the stars are in subjection by His Command: verily in this are Signs for men who are wise.

source: وما ذرأ لكم في الأرض مختلفا ألوانه إن في ذلك لآية لقوم يذكرون
en: And the things on this earth which He has multiplied in varying colours (and qualities): verily in this is a sign for men who celebrate the praises of Allah (in gratitude).

source: وهو الذي سخر البحر لتأكلوا منه لحما طريا وتستخرجوا منه حلية تلبسونها وترى الفلك مواخر فيه ولتبتغوا من فضله ولعلكم تشكرون
en: It is He Who has made the sea subject, that ye may eat thereof flesh that is fresh and tender, and that ye may extract therefrom ornaments to wear; and thou seest the ships therein that plough the waves, that ye may seek (thus) of the bounty of Allah and that ye may be grateful.

source: وألقى في الأرض رواسي أن تميد بكم وأنهارا وسبلا لعلكم تهتدون
en: And He has set up on the earth mountains standing firm, lest it should shake with you; and rivers and roads; that ye may guide yourselves;

source: وعلامات وبالنجم هم يهتدون
en: And marks and sign-posts; and by the stars (men) guide themselves.

source: أفمن يخلق كمن لا يخلق أفلا تذكرون
en: Is then He Who creates like one that creates not? Will ye not receive admonition?

source: وإن تعدوا نعمة الله لا تحصوها إن الله لغفور رحيم
en: If ye would count up the favours of Allah, never would ye be able to number them: for Allah is Oft-Forgiving, Most Merciful.

source: والله يعلم ما تسرون وما تعلنون
en: And Allah doth know what ye conceal, and what ye reveal.
